#self.root : Το self.root είναι το κύριο Tkinter παράθυρο που αποθηκεύεται μέσα στην κλάση,
#  ώστε να μπορώ να το χρησιμοποιώ σε όλο το αρχείο.

#ttk.Notebook : Το ttk.Notebook χρησιμοποιείται για να οργανωθεί η εφαρμογή σε καρτέλες,
#  ώστε κάθε λειτουργία να εμφανίζεται σε ξεχωριστή σελίδα.

#Entry: Τα Entry widgets χρησιμοποιούνται για την εισαγωγή δεδομένων από τον χρήστη, 
# όπως ποσό, ημερομηνία ή περιγραφή.

#combobox: Το Combobox επιτρέπει στον χρήστη να επιλέγει από προκαθορισμένες τιμές, όπως ο τύπος συναλλαγής.

#Button : Τα κουμπιά συνδέονται με methods της κλάσης,
#  ώστε όταν ο χρήστης πατά ένα κουμπί, να εκτελείται η αντίστοιχη λειτουργία.

#Treeview : Το Treeview χρησιμοποιείται για δομημένη εμφάνιση δεδομένων σε μορφή πίνακα, 
# όπως κατηγορίες ή συναλλαγές.

#messagebox: Τα messagebox χρησιμοποιούνται για ανατροφοδότηση προς τον χρήστη, όπως μηνύματα επιτυχίας ή σφάλματος.



# Το δικό μου κομμάτι ήταν το γραφικό περιβάλλον της εφαρμογής.
# Η εφαρμογή ξεκινά από το main.py, όπου δημιουργείται το βασικό παράθυρο Tkinter και φορτώνεται η κύρια κλάση του GUI.
# Στο main_window.py χρησιμοποιείται ttk.Notebook ώστε οι βασικές λειτουργίες να οργανώνονται σε καρτέλες.
# Η καρτέλα transactions_tab.py υλοποιεί τη φόρμα εισαγωγής συναλλαγών, όπου ο χρήστης συμπληρώνει στοιχεία όπως ποσό, τύπο, κατηγορία, ημερομηνία και περιγραφή.
# Η καρτέλα categories_tab.py επιτρέπει την προσθήκη και προβολή κατηγοριών μέσω Treeview.
# Συνολικά, το GUI είναι υπεύθυνο για την αλληλεπίδραση με τον χρήστη, την εισαγωγή δεδομένων και την οπτική παρουσίασή τους, ενώ η λογική και η αποθήκευση δεδομένων υλοποιούνται σε άλλο επίπεδο της εφαρμογής
