# #Τα service files είναι το “ενδιάμεσο στρώμα” ανάμεσα στο GUI και στο backend.
# Το GUI δεν κάνει αποθήκευση ούτε queries· καλεί services.

# Τα services στο project υλοποιήθηκαν αρχικά ως placeholders, ώστε να μπορέσει να αναπτυχθεί το γραφικό περιβάλλον ανεξάρτητα από το backend.
# Το GUI καλεί τις service συναρτήσεις χωρίς να γνωρίζει πώς υλοποιούνται εσωτερικά.
# Στην τελική έκδοση, τα ίδια services θα συνδεθούν με τη βάση δεδομένων χωρίς αλλαγή στη λογική του GUI

# future implementation
# Τα services είναι η μόνη γέφυρα ανάμεσα στο GUI και τη βάση. Το GUI μιλά μόνο με services, τα services μιλάνε με τη βάση.

